notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>OT Notes</title>
<!-- 2015-06-28 Sun 11:53 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jahfer Husain" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">OT Notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. General</a>
<ul>
<li><a href="#sec-1-1">1.1. Ideas for multiple cursors</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Store as metadata</a></li>
<li><a href="#sec-1-1-2">1.1.2. Store as operation (is transient, so may not make sense)</a></li>
<li><a href="#sec-1-1-3">1.1.3. Pass as completely separate feed (seems weird b/c dependent on positions)</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. How to Render</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. Use react-style components for all nodes, and track edits within and between!</a></li>
<li><a href="#sec-1-2-2">1.2.2. Parse to data structure, render however you want!</a></li>
<li><a href="#sec-1-2-3">1.2.3. Good idea: B+ Tree for applying operations on data structure.</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> General</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Ideas for multiple cursors</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Store as metadata</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #FFA070;">def</span> <span style="color: #A197BF;">operation</span> ^<span style="color: #93a8c6;">{</span><span style="color: #6F8FCC;">::cursor</span> <span style="color: #b0b1a3;">{</span><span style="color: #6F8FCC;">:position</span> 4 <span style="color: #6F8FCC;">:name</span> <span style="color: #868B44;">"Jahfer"</span><span style="color: #b0b1a3;">}</span><span style="color: #93a8c6;">}</span>
  <span style="color: #93a8c6;">{</span><span style="color: #6F8FCC;">:ops</span> <span style="color: #b0b1a3;">[]</span> <span style="color: #6F8FCC;">:client-id</span> <span style="color: #868B44;">"client-a9d9h-a3"</span> <span style="color: #6F8FCC;">:parent-id</span> 4 <span style="color: #6F8FCC;">:id</span> 5<span style="color: #93a8c6;">}</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Store as operation (is transient, so may not make sense)</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>-&gt;Op <span style="color: #6F8FCC;">:cursor</span> <span style="color: #93a8c6;">{</span><span style="color: #6F8FCC;">:position</span> 4 <span style="color: #6F8FCC;">:name</span> <span style="color: #868B44;">"Jahfer"</span><span style="color: #93a8c6;">}</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> Pass as completely separate feed (seems weird b/c dependent on positions)</h4>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> How to Render</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Use react-style components for all nodes, and track edits within and between!</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>Text changes happen in a <code>&lt;OTText&gt;</code> element, images are <code>&lt;OTImage&gt;</code>, cursors are potentially a separate layer on top?
</li>
</ul>
<div class="org-src-container">

<pre class="src src-xml">&lt;<span style="color: #8AAFFA;">Document</span>&gt;
  &lt;<span style="color: #8AAFFA;">OTText</span>&gt;Hello World. &lt;/<span style="color: #8AAFFA;">OTText</span>&gt;&lt;<span style="color: #8AAFFA;">OTLink</span> <span style="color: #A197BF;">href</span>=<span style="color: #868B44;">"</span><span style="color: #868B44;">http://google.com</span><span style="color: #868B44;">"</span>&gt;Click me!&lt;/<span style="color: #8AAFFA;">OTLink</span>&gt;
  &lt;<span style="color: #8AAFFA;">OTImage</span> <span style="color: #A197BF;">src</span>=<span style="color: #868B44;">"</span><span style="color: #868B44;">http://google.com/image.png</span><span style="color: #868B44;">"</span>&gt;
&lt;/<span style="color: #8AAFFA;">Document</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Parse to data structure, render however you want!</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>Keep data structure around to apply operations onto? Sounds tricky, but necessary
</li>
<li>The key is to represent your document as data!!!!
</li>
</ul>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #8c8c8c;">[</span><span style="color: #93a8c6;">{</span><span style="color: #6F8FCC;">:node-type</span> <span style="color: #6F8FCC;">:text</span> <span style="color: #6F8FCC;">:length</span> 7 <span style="color: #6F8FCC;">:data</span> <span style="color: #868B44;">"Hello, "</span><span style="color: #93a8c6;">}</span>
 <span style="color: #93a8c6;">{</span><span style="color: #6F8FCC;">:node-type</span> <span style="color: #6F8FCC;">:link</span> <span style="color: #6F8FCC;">:length</span> 6 <span style="color: #6F8FCC;">:data</span> <span style="color: #b0b1a3;">{</span><span style="color: #6F8FCC;">:href</span> <span style="color: #868B44;">"http://jahfer.com"</span>
<span style="background-color: #fffacd;">                                </span>    <span style="color: #6F8FCC;">:text</span> <span style="color: #868B44;">"Jahfer"</span>
<span style="background-color: #fffacd;">                                </span>    <span style="color: #6F8FCC;">:alt</span> <span style="color: #868B44;">"Jahfer Husain's Portfolio"</span><span style="color: #b0b1a3;">}</span><span style="color: #93a8c6;">}</span>
 <span style="color: #93a8c6;">{</span><span style="color: #6F8FCC;">:node-type</span> <span style="color: #6F8FCC;">:text</span> <span style="color: #6F8FCC;">:length</span> 1 <span style="color: #6F8FCC;">:data</span> <span style="color: #868B44;">"!"</span><span style="color: #93a8c6;">}</span><span style="color: #8c8c8c;">]</span>
</pre>
</div>
<blockquote>
<p>
"Hello, Jahfer!"
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Good idea: B+ Tree for applying operations on data structure.</h4>
<div class="outline-text-4" id="text-1-2-3">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2015-06-27 Sat 23:56]</span></span> <br  />
     That way we can skip large chunks of the document to apply operations to the correct area.
</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jahfer Husain</p>
<p class="date">Created: 2015-06-28 Sun 11:53</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.4 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
